driver-tests/bpelse/assign/AssignJbi/test/results/echoDecimalDataType_Invoke/Actual_20130319180445_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <item xmlns="http://stc.com/echoDecimalDataType" xmlns:msgns="http://stc.com/echoDecimalDataType">
      <string>1000.00</string>
      <normalizedString>1000.00</normalizedString>
      <token>1000.00</token>
      <base64Binary>1000.00</base64Binary>
      <hexBinary>1000.00</hexBinary>
      <integer>1000.00</integer>
      <positiveInteger>1000.00</positiveInteger>
      <negativeInteger>1000.00</negativeInteger>
      <nonNegativeInteger>1000.00</nonNegativeInteger>
      <nonPositiveInteger>1000.00</nonPositiveInteger>
      <long>1000.00</long>
      <unsignedLong>1000.00</unsignedLong>
      <int>1000.00</int>
      <unsignedInt>1000.00</unsignedInt>
      <short>1000.00</short>
      <unsignedShort>1000.00</unsignedShort>
      <byte>1000.00</byte>
      <unsignedByte>1000.00</unsignedByte>
      <decimal>1000.00</decimal>
      <float>1000.00</float>
      <double>1000.00</double>
      <boolean>1000.00</boolean>
      <duration>1000.00</duration>
      <dateTime>1000.00</dateTime>
      <date>1000.00</date>
      <time>1000.00</time>
      <gYear>1000.00</gYear>
      <gYearMonth>1000.00</gYearMonth>
      <gMonth>1000.00</gMonth>
      <gMonthDay>1000.00</gMonthDay>
      <gDay>1000.00</gDay>
      <Name>1000.00</Name>
      <QName>1000.00</QName>
      <NCName>1000.00</NCName>
      <anyURI>1000.00</anyURI>
      <language>1000.00</language>
      <ID>1000.00</ID>
      <IDREF>1000.00</IDREF>
      <IDREFS>1000.00</IDREFS>
      <ENTITY>1000.00</ENTITY>
      <ENTITIES>1000.00</ENTITIES>
      <NMTOKEN>1000.00</NMTOKEN>
      <NMTOKENS>1000.00</NMTOKENS>
    </item>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>